#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.users.null_resource.build: Refreshing state... [id=3032732537415371862]
module.frontend.random_pet.this: Refreshing state... [id=oddly-feasible-sheepdog]
module.users.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=bkwb43pdx4]
module.users.module.api_log_group.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=videoStreamer-dev]
module.users.aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_U0QsuLBDF]
module.frontend.module.s3_one.aws_s3_bucket.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.frontend.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.users.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.users.aws_ssm_parameter.users_pool_id: Refreshing state... [id=/videoStreamer/dev/pool_id]
module.users.aws_cognito_user_pool_client.client: Refreshing state... [id=3hvgn496jss3qf1be2bjqb6mpr]
module.users.aws_ssm_parameter.users_client_id: Refreshing state... [id=/videoStreamer/dev/client_id]
module.users.aws_ssm_parameter.users_client_secret: Refreshing state... [id=/videoStreamer/dev/client_secret]
module.users.module.lambdas["register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_register]
module.users.module.lambdas["confirm_register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_confirm_register]
module.users.module.lambdas["login"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_login]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=261a574a-22ff-4a2f-8a1c-6a31c43d9262]
module.users.module.lambdas["register"].local_file.archive_plan[0]: Refreshing state... [id=7cd3ec949c4e2d7c30b1bf3697bad0f5abf678cd]
module.users.module.lambdas["confirm_register"].local_file.archive_plan[0]: Refreshing state... [id=5033c6558c4125206a7335e0a5de1bbc1ba01f9a]
module.users.module.lambdas["login"].local_file.archive_plan[0]: Refreshing state... [id=ad4b58abe32b18f2e5e537335bf1541e2103a06b]
module.users.module.lambdas["register"].null_resource.archive[0]: Refreshing state... [id=6234632919805566617]
module.users.module.lambdas["confirm_register"].null_resource.archive[0]: Refreshing state... [id=6644607504059265109]
module.users.module.lambdas["login"].null_resource.archive[0]: Refreshing state... [id=2495429232584332421]
module.users.module.lambdas["register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_register]
module.users.module.lambdas["login"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_login]
module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_confirm_register]
module.frontend.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/7f7367c6-e7f4-4123-9c9c-31819121e9e8]
module.frontend.module.cdn.aws_cloudfront_origin_access_identity.this["s3_bucket_one"]: Refreshing state... [id=E14FTGNQB6ANNI]
module.frontend.module.log_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.frontend.module.s3_one.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.frontend.module.s3_one.aws_s3_bucket_acl.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog,private]
module.frontend.aws_ssm_parameter.cdn_bucket: Refreshing state... [id=/video/cdn/bucket]
module.frontend.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_confirm_register-logs]
module.users.module.lambdas["login"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_login-logs]
module.users.module.lambdas["register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_register-logs]
module.users.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:529080338478:certificate/9d043360-071c-4e63-b391-432548a5fe3c]
module.frontend.module.s3_one.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.users.module.lambdas["login"].aws_lambda_function.this[0]: Refreshing state... [id=auth_login]
module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_confirm_register]
module.users.module.lambdas["register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_register]
module.frontend.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z0504674431EVA0LRLBF__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.users.module.lambdas["confirm_register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_confirm_register-20220426045657940800000004]
module.users.module.lambdas["login"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_login-20220426045657880400000002]
module.users.module.lambdas["register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_register-20220426045657892300000003]
module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"]: Refreshing state... [id=xborzhg]
module.users.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__d15789f6dfdbf2a94e5e29ee974e9637.auth.video.rayprogramming.com._CNAME]
module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"]: Refreshing state... [id=cf66wkg]
module.frontend.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-26 04:57:04.317 +0000 UTC]
module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"]: Refreshing state... [id=7zmmhb6]
module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"]: Refreshing state... [id=78zff44]
module.frontend.module.cdn.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2DOLLEMQEN77H]
module.users.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-26 04:57:03.669 +0000 UTC]
module.frontend.module.cdn.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E2DOLLEMQEN77H]
module.frontend.module.records.aws_route53_record.this["www.video.rayprogramming.com A"]: Refreshing state... [id=Z0504674431EVA0LRLBF_www.video.rayprogramming.com.video.rayprogramming.com_A]
module.users.module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=auth.video.rayprogramming.com]
module.frontend.module.records.aws_route53_record.this["video.rayprogramming.com A"]: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com.video.rayprogramming.com_A]
module.users.module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=snhq0r]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/confirmRegistration.js",
                      - null,
                    ],
                ]
              - filename      = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.plan.json" -> null
      - id                   = "5033c6558c4125206a7335e0a5de1bbc1ba01f9a" -> null
    }

  # module.users.module.lambdas["login"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/login.js",
                      - null,
                    ],
                ]
              - filename      = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.plan.json" -> null
      - id                   = "ad4b58abe32b18f2e5e537335bf1541e2103a06b" -> null
    }

  # module.users.module.lambdas["register"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/register.js",
                      - null,
                    ],
                ]
              - filename      = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.plan.json" -> null
      - id                   = "7cd3ec949c4e2d7c30b1bf3697bad0f5abf678cd" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.users.null_resource.build must be replaced
+/- resource "null_resource" "build" {
      ~ id       = "3032732537415371862" -> (known after apply)
      ~ triggers = {
          - "always" = "2022-05-01T05:44:39Z"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "2777561895" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["confirm_register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["confirm_register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/confirmRegistration.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.plan.json"
          - "filename"            = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.zip"
          - "timestamp"           = "1651383898886380000"
          - "was_missing"         = "true"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_confirm_register-logs"
        name      = "auth_confirm_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_confirm_register"
        name                  = "auth_confirm_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.zip" -> (known after apply)
        id                             = "auth_confirm_register"
      ~ last_modified                  = "2022-05-01T04:59:13.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_confirm_register:6" -> (known after apply)
      ~ source_code_hash               = "wtkcPs3MEcU0W8ev/12GBYBM1K1fOqIInx/+p+m1IGs=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "6" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["confirm_register"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6644607504059265109" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/5a76116141aa36523b8c1fbc8718560ffb446191490438a70e814c5e7c605cc0.zip"
          - "timestamp" = "1651383898886380000"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["login"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["login"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "3321659073" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["login"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["login"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/login.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.plan.json"
          - "filename"            = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.zip"
          - "timestamp"           = "1651383898814991000"
          - "was_missing"         = "true"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["login"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_login-logs"
        name      = "auth_login-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["login"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_login"
        name                  = "auth_login"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["login"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.zip" -> (known after apply)
        id                             = "auth_login"
      ~ last_modified                  = "2022-05-01T04:59:19.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_login:2" -> (known after apply)
      ~ source_code_hash               = "JXkYoGX4dq9aBqNlrYuLgjtTkVF6XhzCV0wyQNKFOa8=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "2" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["login"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["login"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2495429232584332421" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/cb5b5a04bc769eb416d7709170edc062b213561ea88a700aa8c06c7bb0a65e5e.zip"
          - "timestamp" = "1651383898814991000"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "4227650822" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/register.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.plan.json"
          - "filename"            = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.zip"
          - "timestamp"           = "1651383898820892000"
          - "was_missing"         = "true"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["register"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_register-logs"
        name      = "auth_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["register"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_register"
        name                  = "auth_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["register"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.zip" -> (known after apply)
        id                             = "auth_register"
      ~ last_modified                  = "2022-05-01T04:59:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_register:6" -> (known after apply)
      ~ source_code_hash               = "y0kUzXH//kyLLu7NSraFebH5BLiBcFHOcYMhnQMXPc4=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "6" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["register"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["register"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6234632919805566617" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/08092084b253b4e41a001fc8bebf9676272edee9663f6d83d428fc1aa3d1ed33.zip"
          - "timestamp" = "1651383898820892000"
        } -> (known after apply) # forces replacement
    }

Plan: 7 to add, 9 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*